Repository: syntheticfuture/circuitpython
Catalog: locale/*.po
Languages: ja, pl

source: No timer available
ja: 利用できるタイマーなし
pl: Brak dostępnego timera

source: Not connected
ja: 接続されていません
pl: Nie podłączono

source: Not playing
ja: 再生していません
pl: Nic nie jest odtwarzane

source: Object has been deinitialized and can no longer be used. Create a new object.
ja: オブジェクトは解放済みでもう使われていません。新しいオブジェクトを作成してください
pl: Obiekt został zwolniony i nie można go już używać. Utwórz nowy obiekt.

source: Odd parity is not supported
ja: 奇数パリティには対応していません
pl: Nieparzysta parzystość nie jest wspierana

source: Only 8 or 16 bit mono with
ja: 8または16ビットの
pl: Tylko 8 lub 16 bitów mono z

source: Only Windows format, uncompressed BMP supported: given header size is %d
pl: Wspierane są tylko nieskompresowane pliki BMP: wielkość nagłówka %d

source: Only one color can be transparent at a time
pl: W danym momencie przezroczysty może być tylko jeden kolor

source: Oversample must be multiple of 8.
ja: オーバーサンプルは8の倍数でなければなりません
pl: Nadpróbkowanie musi być wielokrotnością 8.

source: PWM duty_cycle must be between 0 and 65535 inclusive (16 bit resolution)
ja: PWMのduty_cycle値は0から65535の間でなければなりません（16ビット解像度）
pl: duty_cycle musi być pomiędzy 0 a 65535 włącznie (rozdzielczość 16 bit)

source: PWM frequency not writable when variable_frequency is False on construction.
ja: PWM周波数は生成時のvariable_frequencyがFalseのとき書き換え不可
pl: Nie można zmienić częstotliwości PWM gdy variable_frequency=False.

source: ParallelBus not yet supported
ja: ParallelBusにはまだ対応していません
pl: ParallelBus nie jest jeszcze obsługiwany

source: Permission denied
ja: パーミッション拒否
pl: Odmowa dostępu

source: Pin does not have ADC capabilities
ja: ピンにADCの能力がありません
pl: Nóżka nie obsługuje ADC

source: Pin must support hardware interrupts
ja: ピンはハードウェア割り込みに対応していなければなりません
pl: Pin musi obsługiwać przerwania sprzętowe

source: Plus any modules on the filesystem
pl: Oraz moduły w systemie plików

source: Polygon needs at least 3 points
ja: ポリゴンには少なくとも3つの点が必要
pl: Wielokąt musi mieć co najmniej 3 punkty

source: Press any key to enter the REPL. Use CTRL-D to reload.
ja: 何らかのキーを押すとREPLに入ります。CTRL-Dでリロード。
pl: Dowolny klawisz aby uruchomić konsolę. CTRL-D aby przeładować.

source: Pull not used when direction is output.
ja: 方向がoutputのときpullは使われません
pl: Podciągnięcie nieużywane w trybie wyjścia.

source: RTC calibration is not supported on this board
ja: このボードはRTCのキャリブレーションに非対応
pl: Brak obsługi kalibracji RTC

source: RTC is not supported on this board
ja: このボードはRTCに対応していません
pl: Brak obsługi RTC

source: Random number generation error
ja: 乱数生成エラー
pl: Błąd generowania liczb losowych

source: Read-only
ja: 読み込み専用
pl: Tylko do odczytu

source: Read-only filesystem
ja: 読み込み専用のファイルシステム
pl: System plików tylko do odczytu

source: Read-only object
ja: 読み込み専用のオブジェクト
pl: Obiekt tylko do odczytu

source: Refresh too soon
ja: リフレッシュが早すぎます
pl: Zbyt wczesne odświeżenie

source: Requested AES mode is unsupported
ja: 要求のAESモードは非対応
pl: Żądany tryb AES nie jest obsługiwany

source: Right channel unsupported
ja: 右チャネルは非対応
pl: Prawy kanał jest niewspierany

source: Row entry must be digitalio.DigitalInOut
ja: Rowの各要素は digitalio.DigitalInOut でなければなりません
pl: Rzędy muszą być digitalio.DigitalInOut

source: SDA or SCL needs a pull up
ja: SDAとSCLにプルアップが必要
pl: SDA lub SCL wymagają podciągnięcia

source: SPI Init Error
ja: SPI初期化エラー
pl: Błąd inicjowania SPI

source: SPI Re-initialization error
ja: SPI再初期化エラー
pl: Błąd ponownej inicjalizacji SPI

source: Sample rate must be positive
ja: サンプルレートは正数でなければなりません
pl: Częstotliwość próbkowania musi być dodatnia

source: Sample rate too high. It must be less than %d
ja: サンプルレートは%d以下でなければなりません
pl: Zbyt wysoka częstotliwość próbkowania. Musi być mniejsza niż %d

source: Scan already in progess. Stop with stop_scan.
ja: 既にスキャン進行中。stop_scanで停止してください
pl: Skanuj już w toku. Zatrzymaj za pomocą stop_scan.

source: Selected CTS pin not valid
ja: 選択されたCTSピンが不正
pl: Wybrany pin CTS jest nieprawidłowy

source: Selected RTS pin not valid
ja: 選択されたRTSピンが正しくありません
pl: Wybrany pin RTS jest nieprawidłowy

source: Serializer in use
ja: シリアライザは使用中
pl: Serializator w użyciu

source: Slice and value different lengths.
ja: スライスと値の長さが一致しません
pl: Fragment i wartość są różnych długości.

source: Slices not supported
ja: スライスは対応していません
pl: Fragmenty nieobsługiwane

source: Source and destination buffers must be the same length
ja: バッファ (元/先) は同じ長さでなければなりません
pl: Bufory źródłowy i docelowy muszą mieć taką samą długość

source: Splitting with sub-captures
pl: Podział z podgrupami

source: Stack size must be at least 256
ja: スタックサイズは少なくとも256以上でなければなりません
pl: Stos musi mieć co najmniej 256 bajtów

source: Stream missing readinto() or write() method.
ja: ストリームにreadinto()またはwrite()メソッドがありません
pl: Strumień nie ma metod readinto() lub write().

source: Supply at least one UART pin
ja: 少なくとも1つのUARTピンが必要
pl: Podaj co najmniej jeden pin UART

source: The sample's bits_per_sample does not match the mixer's
ja: サンプルのbits_per_sampleがミキサーのそれと一致しません
pl: Wartość bits_per_sample nie pasuje do miksera

source: The sample's channel count does not match the mixer's
pl: Liczba kanałów nie pasuje do miksera

source: The sample's sample rate does not match the mixer's
ja: サンプルレートがサンプルとミキサーで一致しません
pl: Sample rate nie pasuje do miksera

source: The sample's signedness does not match the mixer's
ja: 符号の有無がサンプルとミキサーで一致しません
pl: Znak nie pasuje do miksera

source: Tile height must exactly divide bitmap height
ja: タイルの高さはビットマップの高さを割り切れる値でなければなりません
pl: Wysokość bitmapy musi być wielokrotnością wysokości kafelka

source: Tile width must exactly divide bitmap width
ja: タイルの幅はビットマップの幅を割り切れる値でなければなりません
pl: Szerokość bitmapy musi być wielokrotnością szerokości kafelka

source: To exit, please reset the board without
pl: By wyjść, proszę zresetować płytkę bez

source: Too many channels in sample.
ja: サンプルのチャンネル数が多すぎます
pl: Zbyt wiele kanałów.

source: Too many display busses
pl: Zbyt wiele magistrali

source: Too many displays
pl: Zbyt wiele wyświetlaczy

source: Traceback (most recent call last):
ja: トレースバック（最新の呼び出しが末尾）:
pl: Ślad wyjątku (najnowsze wywołanie na końcu):

source: Tuple or struct_time argument required
pl: Wymagana krotka lub struct_time

source: UART Buffer allocation error
ja: UARTバッファの確保エラー
pl: Błąd alokacji bufora UART

source: UART write error
ja: UART書き込みエラー
pl: Błąd zapisu UART

source: USB Busy
ja: USBビジー
pl: USB Zajęte

source: USB Error
ja: USBエラー
pl: Błąd USB

source: UUID string not 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
ja: UUID文字列が 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx' の形式になっていません
pl: UUID inny, niż `xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'

source: UUID value is not str, int or byte buffer
ja: UUIDの値がstr, int, bufferのいずれでもありません
pl: UUID nie jest typu str, int lub bytes

source: Unable to allocate buffers for signed conversion
pl: Nie udała się alokacja buforów do konwersji ze znakiem

source: Unable to find free GCLK
pl: Brak wolnego GCLK

source: Unable to init parser
ja: パーザを初期化できません
pl: Błąd ustawienia parsera

source: Unable to read color palette data
ja: カラーパレットデータを読み込めません
pl: Nie można odczytać danych palety

source: Unable to write to nvm.
ja: nvmに書き込みできません
pl: Błąd zapisu do NVM.

source: Unexpected nrfx uuid type
ja: 想定されていないnrfx UUID型
pl: Nieoczekiwany typ nrfx uuid

source: Unmatched number of items on RHS (expected %d, got %d).
ja: 右辺の要素数が一致しません (expected %d, got %d)
pl: Zła liczba obiektów po prawej stronie (oczekiwano %d, jest %d).

source: Unsupported baudrate
ja: 非対応のbaudrate
pl: Zła szybkość transmisji

source: Unsupported display bus type
pl: Zły typ magistrali wyświetlaczy

source: Unsupported format
ja: 非対応の形式
pl: Zły format

source: Unsupported operation
ja: 非対応の操作
pl: Zła operacja

source: Unsupported pull value.
ja: 非対応のpull値
pl: Zła wartość podciągnięcia.

source: Viper functions don't currently support more than 4 arguments
pl: Funkcje Viper nie obsługują obecnie więcej niż 4 argumentów

source: WARNING: Your code filename has two extensions
pl: UWAGA: Nazwa pliku ma dwa rozszerzenia

source: WatchDogTimer.timeout must be greater than 0
ja: WatchDogTimer.timeoutは0以上でなければなりません
pl: WatchDogTimer.timeout musi być większe od 0

source: Welcome to Adafruit CircuitPython %s! Please visit learn.adafruit.com/category/circuitpython for project guides. To list built-in modules please do `help("modules")`.
pl: Witamy w Adafruit CircuitPython %s! Aby zapoznać się z przewodnikami do projektu, odwiedź stronę learn.adafruit.com/category/circuitpython. Aby wyświetlić listę wbudowanych modułów, wpisz `help("modules")`.

source: You requested starting safe mode by
pl: Zażądano trybu bezpieczeństwa przez

source: __init__() should return None
pl: __init__() powinien zwracać None

source: __init__() should return None, not '%q'
pl: __init__() powinno zwrócić None, a nie '%q'

source: __new__ arg must be a user-type
ja: __new__の引数はユーザ型でなければなりません
pl: Argument __new__ musi być typu użytkownika

source: a bytes-like object is required
ja: bytes-likeオブジェクトが必要
pl: wymagany obiekt typu bytes

source: abort() called
ja: abort()が呼ばれました
pl: Wywołano abort()

source: address %08x is not aligned to %d bytes
pl: adres %08x nie jest wyrównany do %d bajtów

source: address out of bounds
ja: アドレスが範囲外
pl: adres poza zakresem

source: addresses is empty
pl: adres jest pusty

source: arg is an empty sequence
pl: arg jest puste

source: argument has wrong type
pl: argument ma zły typ

source: argument num/types mismatch
pl: zła liczba lub typ argumentów

source: argument should be a '%q' not a '%q'
ja: 引数には '%q' が必要（'%q' ではなく）
pl: argument powinien być '%q' a nie '%q'

source: array/bytes required on right side
ja: 右辺にはarray/bytesが必要
pl: tablica/bytes wymagane po prawej stronie

source: attributes not supported yet
ja: 属性は未対応です
pl: atrybuty nie są jeszcze obsługiwane

source: bad compile mode
pl: zły tryb kompilacji

source: bad conversion specifier
pl: zły specyfikator konwersji

source: bad format string
ja: 不正な書式化文字列
pl: zła specyfikacja formatu

source: bad typecode
ja: 不正なtypecode
pl: zły typecode

source: binary op %q not implemented
pl: brak dwu-argumentowego operatora %q

source: bits must be 7, 8 or 9
ja: bitsは7, 8, 9のいずれかでなければなりません
pl: bits musi być 7, 8 lub 9

source: bits_per_sample must be 8 or 16
ja: bits_per_sampleは8または16でなければなりません
pl: bits_per_sample musi być 8 lub 16

source: branch not in range
pl: skok poza zakres

source: buffer must be a bytes-like object
ja: バッファはbytes-likeオブジェクトでなければなりません
pl: bufor mysi być typu bytes

source: buffer size must match format
pl: wielkość bufora musi pasować do formatu

source: buffer slices must be of equal length
ja: バッファのスライスは同じ長さでなければなりません
pl: fragmenty bufora muszą mieć tę samą długość

source: buffer too small
pl: zbyt mały bufor

source: buttons must be digitalio.DigitalInOut
ja: buttonsはdigitalio.DigitalInOutでなければなりません
pl: buttons musi być digitalio.DigitalInOut

source: byte code not implemented
pl: bajtkod niezaimplemntowany

source: bytes > 8 bits not supported
pl: bajty większe od 8 bitów są niewspierane

source: bytes value out of range
ja: 範囲外のバイト値
pl: wartość bytes poza zakresem

source: calibration is out of range
ja: キャリブレーションが範囲外
pl: kalibracja poza zakresem

source: calibration is read only
ja: calibrationは読み込み専用
pl: kalibracja tylko do odczytu

source: calibration value out of range +/-127
pl: wartość kalibracji poza zakresem +/-127

source: can only have up to 4 parameters to Thumb assembly
pl: asembler Thumb może przyjąć do 4 parameterów

source: can only have up to 4 parameters to Xtensa assembly
pl: asembler Xtensa może przyjąć do 4 parameterów

source: can only save bytecode
pl: można zapisać tylko bytecode

source: can't add special method to already-subclassed class
ja: サブクラス化済みのクラスに特殊メソッドを追加できません
pl: nie można dodać specjalnej metody do podklasy

source: can't assign to expression
ja: 式には代入できません
pl: przypisanie do wyrażenia

source: can't convert %q to %q
ja: %qを%qに変換できません
pl: nie można dokonać konwersji %q na %q

source: can't convert '%q' object to %q implicitly
ja: オブジェクト '%q' を %q に暗黙に変換できません
pl: nie można automatycznie skonwertować '%q' do '%q'

source: can't convert to str implicitly
pl: nie można automatycznie skonwertować do str

source: can't declare nonlocal in outer code
ja: 外側のコードでnonlocalは使えません
pl: deklaracja nonlocal na poziomie modułu

source: can't delete expression
pl: nie można usunąć wyrażenia

source: can't do binary op between '%q' and '%q'
pl: nie można użyć operatora pomiędzy '%q' a '%q'

source: can't do truncated division of a complex number
ja: 複素数の切り捨て除算はできません
pl: nie można wykonać dzielenia całkowitego na liczbie zespolonej

source: can't have multiple **x
ja: 複数の **x は持てません
pl: nie można mieć wielu **x

source: can't have multiple *x
ja: 複数の *x は持てません
pl: nie można mieć wielu *x

source: can't implicitly convert '%q' to 'bool'
pl: nie można automatyczne skonwertować '%q' do 'bool'

source: can't load from '%q'
pl: nie można ładować z '%q'

source: can't load with '%q' index
pl: nie można ładować z indeksem '%q'

source: can't pend throw to just-started generator
pl: nie można skoczyć do świeżo stworzonego generatora

source: can't send non-None value to a just-started generator
pl: świeżo stworzony generator może tylko przyjąć None

source: can't set attribute
pl: nie można ustawić atrybutu

source: can't store '%q'
pl: nie można zapisać '%q'

source: can't store to '%q'
pl: nie można zpisać do '%q'

source: can't store with '%q' index
pl: nie można zapisać z indeksem '%q'

source: can't switch from automatic field numbering to manual field specification
pl: nie można zmienić z automatycznego numerowania pól do ręcznego

source: can't switch from manual field specification to automatic field numbering
ja: 手動と自動のフィールド指定は混在できません
pl: nie można zmienić z ręcznego numerowaniu pól do automatycznego

source: cannot create '%q' instances
pl: nie można tworzyć instancji '%q'

source: cannot create instance
ja: インスタンスを作れません
pl: nie można stworzyć instancji

source: cannot import name %q
pl: nie można zaimportować nazwy %q

source: cannot perform relative import
ja: 相対インポートはできません
pl: nie można wykonać relatywnego importu

source: casting
pl: rzutowanie

source: chars buffer too small
pl: bufor chars zbyt mały

source: chr() arg not in range(0x110000)
pl: argument chr() poza zakresem range(0x110000)

source: chr() arg not in range(256)
pl: argument chr() poza zakresem range(256)

source: color buffer must be 3 bytes (RGB) or 4 bytes (RGB + pad byte)
ja: 色バッファは3バイト (RGB) か4バイト (RGB + pad byte) でなければなりません
pl: bufor kolorów musi nieć 3 bajty (RGB) lub 4 bajty (RGB + wypełnienie)

source: color buffer must be a bytearray or array of type 'b' or 'B'
ja: 色バッファは、bytearrayまたはタイプが 'b' か 'B' のarrayでなければなりません
pl: bufor kolorów musi być bytearray lub tablicą typu 'b' lub 'B'

source: color must be between 0x000000 and 0xffffff
ja: 色は0x000000から0xffffffでなければなりません
pl: kolor musi być pomiędzy 0x000000 a 0xffffff

source: color should be an int
pl: kolor powinien być liczbą całkowitą

source: complex division by zero
ja: 複素数ゼロ除算
pl: zespolone dzielenie przez zero

source: complex values not supported
pl: wartości zespolone nieobsługiwane

source: compression header
ja: 圧縮ヘッダー
pl: nagłówek kompresji

source: constant must be an integer
ja: 定数は整数でなければなりません
pl: stała musi być liczbą całkowitą

source: conversion to object
pl: konwersja do obiektu

source: couldn't determine SD card version
pl: nie można określić wersji karty SD

source: decimal numbers not supported
pl: liczby dziesiętne nieobsługiwane

source: default 'except' must be last
ja: デフォルトのexceptは最後に置く必要があります
pl: domyślny 'except' musi być ostatni

source: destination buffer must be a bytearray or array of type 'B' for bit_depth = 8
ja: bit_depth = 8のとき、宛先バッファはbytearrayまたはタイプ'B'のarrayでなければなりません
pl: bufor docelowy musi być bytearray lub tablicą typu 'B' dla bit_depth = 8

source: destination buffer must be an array of type 'H' for bit_depth = 16
ja: bit_depath = 16用のバッファはタイプ'H'のarrayでなければなりません
pl: bufor docelowy musi być tablicą typu 'H' dla bit_depth = 16

source: destination_length must be an int >= 0
ja: desitination_lengthは正の整数でなければなりません
pl: destination_length musi być nieujemną liczbą całkowitą

source: dict update sequence has wrong length
pl: sekwencja ma złą długość

source: division by zero
ja: ゼロ除算 (division by zero)
pl: dzielenie przez zero

source: empty
pl: puste

source: empty heap
pl: pusta sterta

source: empty separator
pl: pusty separator

source: empty sequence
pl: pusta sekwencja

source: end of format while looking for conversion specifier
pl: koniec formatu przy szukaniu specyfikacji konwersji

source: end_x should be an int
ja: end_xは整数でなければなりません
pl: end_x powinien być całkowity

source: error = 0x%08lX
ja: error = 0x1%08lX
pl: błąd = 0x%08lX

source: exceptions must derive from BaseException
ja: 例外はBaseExceptionから派生していなければなりません
pl: wyjątki muszą dziedziczyć po BaseException

source: expected ':' after format specifier
ja: 書式化指定子の後に':'が必要
pl: oczekiwano ':' po specyfikacji formatu

source: expected tuple/list
ja: タプルまたはリストが必要
pl: oczekiwano krotki/listy

source: expecting a dict for keyword args
pl: oczekiwano dict dla argumentów nazwanych

source: expecting an assembler instruction
ja: アセンブラ命令が必要
pl: oczekiwano instrukcji asemblera

source: expecting just a value for set
ja: setには値のみが必要
pl: oczekiwano tylko wartości dla zbioru

source: expecting key:value for dict
ja: dictには key:value が必要
pl: oczekiwano klucz:wartość dla słownika

source: extra keyword arguments given
ja: 余分なキーワード引数があります
pl: nadmiarowe argumenty nazwane

source: extra positional arguments given
ja: 余分な位置引数が与えられました
pl: nadmiarowe argumenty pozycyjne

source: file must be a file opened in byte mode
ja: fileはバイトモードで開かれたファイルでなければなりません
pl: file musi być otwarte w trybie bajtowym

source: filesystem must provide mount method
ja: filesystemはmountメソッドを提供しなければなりません
pl: system plików musi mieć metodę mount

source: first argument must be a function
ja: 1つ目の引数は関数でなければなりません
pl: pierwszy argument musi być funkcją

source: first argument must be an iterable
ja: 1つ目の引数はイテレート可能でなければなりません
pl: pierwszy argument musi być iterowalny

source: first argument to super() must be type
ja: superの第1引数は型でなければなりません
pl: pierwszy argument super() musi być typem

source: float too big
ja: floatの値が大きすぎます
pl: float zbyt wielki

source: font must be 2048 bytes long
ja: fontは2048バイト長でなければなりません
pl: font musi mieć 2048 bajtów długości

source: format requires a dict
ja: formatにはdictが必要
pl: format wymaga słownika

source: full
pl: pełny

source: function does not take keyword arguments
pl: funkcja nie bierze argumentów nazwanych

source: function expected at most %d arguments, got %d
pl: funkcja bierze najwyżej %d argumentów, jest %d

source: function got multiple values for argument '%q'
pl: funkcja dostała wiele wartości dla argumentu '%q'

source: function missing %d required positional arguments
pl: brak %d wymaganych argumentów pozycyjnych funkcji

source: function missing keyword-only argument
ja: キーワード専用引数が足りません
pl: brak argumentu nazwanego funkcji

source: function missing required keyword argument '%q'
ja: 必須のキーワード引数'%q'が与えられていません
pl: brak wymaganego argumentu nazwanego '%q' funkcji

source: function missing required positional argument #%d
pl: brak wymaganego argumentu pozycyjnego #%d funkcji

source: function takes %d positional arguments but %d were given
pl: funkcja wymaga %d argumentów pozycyjnych, ale jest %d

source: function takes exactly 9 arguments
ja: 関数はちょうど9個の引数をとります
pl: funkcja wymaga dokładnie 9 argumentów

source: generator already executing
pl: generator już się wykonuje

source: generator ignored GeneratorExit
pl: generator zignorował GeneratorExit

source: graphic must be 2048 bytes long
ja: graphicは2048バイトでなければなりません
pl: graphic musi mieć 2048 bajtów długości

source: heap must be a list
ja: heapにはリストが必要
pl: heap musi być listą

source: identifier redefined as global
pl: nazwa przedefiniowana jako globalna

source: identifier redefined as nonlocal
pl: nazwa przedefiniowana jako nielokalna

source: incomplete format
pl: niepełny format

source: incomplete format key
pl: niepełny klucz formatu

source: incorrect padding
pl: złe wypełnienie

source: index is out of bounds
pl: indeks jest poza zakresem

source: index out of range
ja: インデクスが範囲外
pl: indeks poza zakresem

source: indices must be integers
ja: インデクスは整数でなければなりません
pl: indeksy muszą być całkowite

source: initial values must be iterable
pl: wartości początkowe muszą być iterowalne

source: initial_value length is wrong
pl: długość initial_value jest nieprawidłowa

source: inline assembler must be a function
ja: インラインアセンブラは関数でなければなりません
pl: wtrącony asembler musi być funkcją

source: input array length must be power of 2
ja: 入力array長は2の累乗でなければなりません
pl: długość tablicy wejściowej musi być potęgą 2

source: input must be square matrix
ja: 入力は正方行列でなければなりません
pl: wejście musi być macierzą kwadratową

source: input vectors must be of equal length
pl: wektory wejściowe muszą być równej długości

source: int() arg 2 must be >= 2 and <= 36
ja: int()の第2引数は2以上36以下でなければなりません
pl: argument 2 do int() busi być pomiędzy 2 a 36

source: integer required
ja: 整数が必要
pl: wymagana liczba całkowita

source: interval must be in range %s-%s
ja: intervalは%s-%sの範囲でなければなりません
pl: interwał musi mieścić się w zakresie %s-%s

source: invalid arguments
ja: 不正な引数
pl: złe arguemnty

source: invalid cert
ja: 不正な証明書
pl: zły ceryfikat

source: invalid dupterm index
ja: 不正なduptermインデクス
pl: zły indeks dupterm

source: invalid format
pl: zły format

source: invalid format specifier
pl: zła specyfikacja formatu

source: invalid key
ja: 不正な鍵
pl: zły klucz

source: invalid micropython decorator
ja: 不正なmicropythonデコレータ
pl: zły dekorator micropythona

source: invalid step
ja: 不正なステップ
pl: zły krok

source: invalid syntax
ja: 不正な構文
pl: zła składnia

source: invalid syntax for integer
ja: 整数の構文が不正
pl: zła składnia dla liczby całkowitej

source: invalid syntax for integer with base %d
pl: zła składnia dla liczby całkowitej w bazie %d

source: invalid syntax for number
ja: 数字として不正な構文
pl: zła składnia dla liczby

source: issubclass() arg 1 must be a class
ja: issubclass()の第1引数はクラスでなければなりません
pl: argument 1 dla issubclass() musi być klasą

source: issubclass() arg 2 must be a class or a tuple of classes
ja: issubclass()の第2引数はクラスかクラスのタプルでなければなりません
pl: argument 2 dla issubclass() musi być klasą lub krotką klas

source: join expects a list of str/bytes objects consistent with self object
ja: joinには str/bytes (のうち自身と一致した型の) リストが必要
pl: join oczekuje listy str/bytes zgodnych z self

source: keyword argument(s) not yet implemented - use normal args instead
ja: キーワード引数は未実装。通常の引数を使ってください
pl: argumenty nazwane nieobsługiwane - proszę użyć zwykłych argumentów

source: keywords must be strings
ja: キーワードは文字列でなければなりません
pl: słowa kluczowe muszą być łańcuchami

source: label '%q' not defined
ja: ラベル'%q'は定義されていません
pl: etykieta '%q' niezdefiniowana

source: label redefined
ja: ラベルの再定義
pl: etykieta przedefiniowana

source: length argument not allowed for this type
pl: ten typ nie pozawala na podanie długości

source: lhs and rhs should be compatible
ja: 左辺と右辺が互換でなければなりません
pl: lewa i prawa strona powinny być kompatybilne

source: local '%q' has type '%q' but source is '%q'
pl: local '%q' jest typu '%q' lecz źródło jest '%q'

source: local '%q' used before type known
pl: local '%q' użyty zanim typ jest znany

source: local variable referenced before assignment
pl: zmienna lokalna użyta przed przypisaniem

source: long int not supported in this build
ja: このビルドはlong intに非対応
pl: long int jest nieobsługiwany

source: map buffer too small
pl: bufor mapy zbyt mały

source: math domain error
ja: 定義域エラー
pl: błąd domeny

source: max_length must be > 0
ja: max_lengthは0より大きくなければなりません
pl: max_length musi być > 0

source: maximum recursion depth exceeded
ja: 最大の再帰深度を超えました
pl: przekroczono dozwoloną głębokość rekurencji
