Repository: syntheticfuture/circuitpython
Catalog: locale/*.po
Languages: ja, pl

source: Code done running. Waiting for reload.
ja: コードの実行が完了しました。リロードを待っています。
pl: Kod wykonany. Czekam na przeładowanie.

source: Please file an issue with the contents of your CIRCUITPY drive at https://github.com/adafruit/circuitpython/issues
ja: CIRCUITPYドライブの内容を添えて問題を以下で報告してください： https://github.com/adafruit/circuitpython/issues
pl: Zgłoś problem z zawartością dysku CIRCUITPY pod adresem https://github.com/adafruit/circuitpython/issues

source: File "%q"
ja: ファイル "%q"
pl: Plik "%q"

source: File "%q", line %d
ja: ファイル "%q", 行 %d
pl: Plik "%q", linia %d

source: output:
ja: 出力:
pl: wyjście:

source: %%c requires int or char
ja: %%c にはintまたはcharが必要
pl: %%c wymaga int lub char

source: %q failure: %d
ja: %q 失敗: %d
pl: %q niepowodzenie: %d

source: %q in use
ja: %qは使用中
pl: %q w użyciu

source: %q index out of range
ja: %q インデックスは範囲外
pl: %q poza zakresem

source: %q indices must be integers, not %q
ja: %q インデクスは %q でなく整数でなければなりません
pl: %q indeksy muszą być liczbami typu int, a nie %q

source: %q must be >= 0
ja: %qは0以上でなければなりません
pl: %q musi być >= 0

source: %q must be >= 1
ja: %qは1以上でなければなりません
pl: %q musi być >= 1

source: %q must be a tuple of length 2
ja: %qは長さ2のタプルでなければなりません
pl: %q musi być krotką o długości 2

source: %q out of range
ja: %q が範囲外
pl: %q poza zakresem

source: %q pin invalid
ja: %q ピンは無効
pl: nieprawidłowy pin %q

source: %q should be an int
ja: %qはint型でなければなりません
pl: %q powinno być typu int

source: %q() takes %d positional arguments but %d were given
ja: %q() は %d 個の位置引数を取りますが、%d 個与えられました
pl: %q() bierze %d argumentów pozycyjnych, lecz podano %d

source: '%q' argument required
ja: '%q' 引数が必要
pl: '%q' wymaga argumentu

source: '%q' object does not support '%q'
ja: '%q' オブジェクトは '%q' に対応していません
pl: Obiekt '%q' nie wspiera '%q'

source: '%q' object does not support item assignment
ja: '%q' オブジェクトは要素の代入に対応していません
pl: '%q' obiekt nie wspiera dopisywania elementów

source: '%q' object does not support item deletion
ja: '%q' オブジェクトは要素の削除に対応していません
pl: obiekt '%q' nie wspiera usuwania elementów

source: '%q' object has no attribute '%q'
ja: オブジェクト'%q'に属性'%q'はありません
pl: Obiekt '%q' nie ma atrybutu '%q'

source: '%q' object is not an iterator
ja: オブジェクト'%q'はイテレータではありません
pl: Obiekt '%q' nie jest iteratorem

source: '%q' object is not callable
ja: オブジェクト'%q'は呼び出し可能ではありません
pl: Obiekt '%q' nie jest wywoływalny

source: '%q' object is not iterable
ja: オブジェクト'%q'はイテレート可能ではありません
pl: Obiekt '%q' nie jest iterowalny

source: '%q' object is not subscriptable
ja: オブジェクト'%q'は要素の取得ができません
pl: obiekt '%q' nie jest indeksowany

source: '%s' expects a label
ja: '%s' にはラベルが必要
pl: '%s' oczekuje etykiety

source: '%s' expects a register
ja: '%s'にはレジスタが必要
pl: '%s' oczekuje rejestru

source: '%s' expects a special register
ja: '%s'には特別レジスタが必要
pl: '%s' oczekuje rejestru specjalnego

source: '%s' expects an FPU register
ja: '%s'にはFPUレジスタが必要
pl: '%s' oczekuje rejestru FPU

source: '%s' expects an address of the form [a, b]
pl: '%s' oczekuje adresu w postaci [a, b]

source: '%s' expects an integer
ja: '%s' には整数が必要
pl: '%s' oczekuje liczby całkowitej

source: '%s' expects at most r%d
pl: '%s' oczekuje co najwyżej r%d

source: '%s' expects {r0, r1, ...}
ja: '%s'には{r0, r1, ...}が必要
pl: '%s' oczekuje {r0, r1, ...}

source: '%s' integer %d is not within range %d..%d
pl: '%s' liczba %d poza zakresem %d..%d

source: '%s' integer 0x%x does not fit in mask 0x%x
pl: '%s' liczba 0x%x nie pasuje do maski 0x%x

source: '=' alignment not allowed in string format specifier
pl: wyrównanie '=' niedozwolone w specyfikacji formatu

source: 'S' and 'O' are not supported format types
pl: typy formatowania 'S' oraz 'O' są niewspierane

source: 'align' requires 1 argument
pl: 'align' wymaga 1 argumentu

source: 'await' outside function
ja: 関数外でのawait
pl: 'await' poza funkcją

source: 'await', 'async for' or 'async with' outside async function
ja: async関数外での await, async for, async with
pl: 'await', 'async for' lub 'async with' poza funkcją asynchroniczną

source: 'break' outside loop
ja: ループ外でのbreak
pl: 'break' poza pętlą

source: 'continue' outside loop
ja: ループ外でのcontinue
pl: 'continue' poza pętlą

source: 'data' requires at least 2 arguments
ja: 'data'には少なくとも2つの引数が必要
pl: 'data' wymaga 2 lub więcej argumentów

source: 'data' requires integer arguments
ja: 'data'には整数の引数が必要
pl: 'data' wymaga całkowitych argumentów

source: 'label' requires 1 argument
ja: 'label'には１つの引数が必要
pl: 'label' wymaga 1 argumentu

source: 'return' outside function
ja: 関数外でのreturn
pl: 'return' poza funkcją

source: 'yield from' inside async function
pl: 'yield from' wewnątrz funkcji asynchronicznej

source: 'yield' outside function
ja: 関数外でのyield
pl: 'yield' poza funkcją

source: *x must be assignment target
ja: *xは代入先でなければなりません
pl: *x musi być obiektem przypisania

source: , in %q
pl: , w %q

source: 0.0 to a complex power
ja: 0.0を複素数でべき乗
pl: 0.0 do potęgi zespolonej

source: 3-arg pow() not supported
ja: 引数3つのpow()は非対応
pl: 3-argumentowy pow() jest niewspierany

source: A hardware interrupt channel is already in use
ja: ハードウェア割り込みチャネルは使用中
pl: Kanał przerwań sprzętowych w użyciu

source: ADC2 is being used by WiFi
pl: ADC2 jest używany przez WiFi

source: Address must be %d bytes long
ja: アドレスは、%dバイト長でなければなりません
pl: Adres musi mieć %d bajtów

source: Address type out of range
ja: address_typeが範囲外
pl: Typ adresu poza zakresem

source: All I2C peripherals are in use
ja: 全てのI2C周辺機器が使用中
pl: Wszystkie peryferia I2C w użyciu

source: All SPI peripherals are in use
ja: 全てのSPI周辺機器が使用中
pl: Wszystkie peryferia SPI w użyciu

source: All UART peripherals are in use
ja: 全てのUART周辺機器が使用中
pl: Wszystkie peryferia UART w użyciu

source: All event channels in use
ja: 全てのイベントチャネルが使用中
pl: Wszystkie kanały zdarzeń w użyciu

source: All sync event channels in use
ja: 全ての同期イベントチャネルが使用中
pl: Wszystkie kanały zdarzeń synchronizacji w użyciu

source: All timers for this pin are in use
ja: このピン用の全てのタイマが使用中
pl: Wszystkie timery tej nóżki w użyciu

source: All timers in use
ja: 全てのタイマーが使用中
pl: Wszystkie timery w użyciu

source: AnalogIn not supported on given pin
ja: 指定のピンはAnalogInに対応していません
pl: AnalogIn nie jest obsługiwany na danym pinie

source: AnalogOut functionality not supported
ja: AnalogOut機能に対応していません
pl: AnalogOut jest niewspierane

source: AnalogOut is only 16 bits. Value must be less than 65536.
ja: AnalogOutは16ビットです。値は65536以下でなければなりません
pl: AnalogOut ma 16 bitów. Wartość musi być mniejsza od 65536.

source: AnalogOut not supported on given pin
ja: 指定のピンはAnalogOutに対応していません
pl: AnalogOut niewspierany na tej nóżce

source: Another send is already active
ja: 他のsendがすでにアクティブ
pl: Wysyłanie jest już w toku

source: Array must contain halfwords (type 'H')
ja: array のタイプは16ビット ('H') でなければなりません
pl: Tablica musi zawierać pół-słowa (typ 'H')

source: Array values should be single bytes.
ja: Arrayの各値は1バイトでなければなりません
pl: Wartości powinny być bajtami.

source: Attempt to allocate %d blocks
ja: %d個のブロックの確保を試みました
pl: Próba przydzielenia %d bloków

source: Attempted heap allocation when MicroPython VM not running.
ja: MicroPython VMの非実行時にヒープ確保を試みました
pl: Próba przydziału sterty, gdy MicroPython VM nie działa.

source: Authentication failure
ja: 認証失敗
pl: Błąd autoryzacji

source: Auto-reload is off.
ja: オートリロードはオフです。
pl: Samo-przeładowywanie wyłączone.

source: Auto-reload is on. Simply save files over USB to run them or enter REPL to disable.
ja: オートリロードがオンです。ファイルをUSB経由で保存するだけで実行できます。REPLに入ると無効化します。
pl: Samo-przeładowywanie włączone. Po prostu zapisz pliki przez USB aby je uruchomić, albo wejdź w konsolę aby wyłączyć.

source: Bit clock and word select must share a clock unit
ja: bit clockとword selectはクロックユニットを共有しなければなりません
pl: Zegar bitowy i wybór słowa muszą współdzielić jednostkę zegara

source: Bit depth must be multiple of 8.
ja: ビット深度は8の倍数でなければなりません
pl: Głębia musi być wielokrotnością 8.

source: Both RX and TX required for flow control
ja: フロー制御のためRXとTXの両方が必要
pl: Do kontroli przepływu wymagane są zarówno RX, jak i TX

source: Both pins must support hardware interrupts
ja: 両方のピンにハードウェア割り込み対応が必要
pl: Obie nóżki muszą wspierać przerwania sprzętowe

source: Brightness must be 0-1.0
ja: brightnessは0から1.0まででなければなりません
pl: Jasność musi wynosić 0-1,0

source: Brightness must be between 0 and 255
ja: Brightnessは0から255の間でなければなりません
pl: Jasność musi być pomiędzy 0 a 255

source: Brightness not adjustable
ja: Brightnessは調整可能ではありません
pl: Jasność nie jest regulowana

source: Buffer + offset too small %d %d %d
ja: buffer + offsetが小さすぎます %d %d %d
pl: Bufor + przesunięcie za małe %d %d %d

source: Buffer incorrect size. Should be %d bytes.
ja: バッファサイズが不正です。%dバイトでなければなりません
pl: Zła wielkość bufora. Powinno być %d bajtów.

source: Buffer is too small
ja: バッファが小さすぎます
pl: Bufor jest za mały

source: Buffer length %d too big. It must be less than %d
ja: バッファ長%dは大きすぎます。%d以下でなければなりません
pl: Długość %d bufora jest za duża. Musi być mniejsza niż %d

source: Buffer length must be a multiple of 512
ja: バッファ長は512の倍数でなければなりません
pl: Długość bufora musi być wielokrotnością 512

source: Buffer must be a multiple of 512 bytes
ja: バッファは512の倍数でなければなりません
pl: Bufor musi być wielokrotnością 512 bajtów

source: Buffer must be at least length 1
ja: バッファ長は少なくとも1以上でなければなりません
pl: Bufor musi mieć długość 1 lub więcej

source: Buffer too large and unable to allocate
ja: バッファが大きすぎて確保できません
pl: Bufor jest zbyt duży i nie można go przydzielić

source: Buffer too short by %d bytes
ja: バッファが %d バイト足りません
pl: Bufor za krótki o %d bajtów

source: Bus pin %d is already in use
ja: Busピン%dはすでに使用中
pl: Nóżka magistrali %d jest w użyciu

source: Byte buffer must be 16 bytes.
ja: バッファは16バイトでなければなりません
pl: Bufor musi mieć 16 bajtów.

source: Bytes must be between 0 and 255.
ja: バイト値は0から255の間でなければなりません
pl: Bytes musi być między 0 a 255.

source: CBC blocks must be multiples of 16 bytes
ja: CBCブロックは16バイトの整数倍でなければなりません
pl: Bloki CBC muszą być wielokrotnościami 16 bajtów

source: Cannot delete values
ja: 値を削除できません
pl: Nie można usunąć

source: Cannot get pull while in output mode
ja: 出力モード時はpullを取得できません
pl: Nie ma podciągnięcia w trybie wyjścia

source: Cannot get temperature
ja: 温度を取得できません
pl: Nie można odczytać temperatury

source: Cannot output both channels on the same pin
ja: 同じピン上の両チャネルに出力できません
pl: Nie można mieć obu kanałów na tej samej nóżce

source: Cannot read without MISO pin.
ja: MISOピンなしで読み込めません
pl: Nie można czytać bez nóżki MISO.

source: Cannot record to a file
ja: ファイルへ記録できません
pl: Nie można nagrać do pliku

source: Cannot remount '/' when USB is active.
ja: USBがアクティブの時に'/'を再マウントできません
pl: Nie można przemontować '/' gdy USB działa.

source: Cannot reset into bootloader because no bootloader is present.
ja: ブートローダが存在しないためブートローダへとリセットできません
pl: Nie można zrestartować -- nie ma bootloadera.

source: Cannot set value when direction is input.
ja: 方向がinputのときは値を設定できません
pl: Nie można ustawić wartości w trybie wejścia.

source: Cannot specify RTS or CTS in RS485 mode
ja: RS485モードにRTSまたはCTSを指定できません
pl: Nie można określić RTS ani CTS w trybie RS485

source: Cannot subclass slice
ja: sliceをサブクラス化することはできません
pl: Nie można dziedziczyć ze slice

source: Cannot transfer without MOSI and MISO pins.
ja: MOSIピンとMISOピンなしに転送できません
pl: Nie można przesyłać bez nóżek MOSI i MISO.

source: Cannot unambiguously get sizeof scalar
ja: スカラのサイズを曖昧さなしに取得できません
pl: Wielkość skalara jest niejednoznaczna

source: Cannot vary frequency on a timer that is already in use
ja: 使用中のタイマー上では周波数を変えられません
pl: Nie można zmieniać częstotliwości timera, który jest już używany

source: Cannot write without MOSI pin.
ja: MOSIピンなしで書き込みできません
pl: Nie można pisać bez nóżki MOSI.

source: CharacteristicBuffer writing not provided
pl: Pisanie do CharacteristicBuffer niewspierane

source: CircuitPython is in safe mode because you pressed the reset button during boot. Press again to exit safe mode.
ja: 起動中にリセットボタンを押したためCircuitPythonはセーフモードにいます。もう一度押すとセーフモードを終了します。
pl: CircuitPython jest w trybie awaryjnym, ponieważ podczas rozruchu naciśnięto przycisk resetowania. Naciśnij ponownie, aby wyjść z trybu awaryjnego.

source: CircuitPython was unable to allocate the heap.
ja: CircuitPythonはヒープを確保できませんでした
pl: CircuitPython nie mógł przydzielić sterty.

source: Clock pin init failed.
ja: クロックピン初期化に失敗
pl: Inicjalizacja nóżki zegara nie powiodła się.

source: Clock stretch too long
ja: クロックのストレッチが長すぎ
pl: Rozciągnięcie zegara zbyt duże

source: Clock unit in use
ja: クロックユニットは使用中
pl: Jednostka zegara w użyciu

source: Column entry must be digitalio.DigitalInOut
ja: Columnの要素は digitalio.DigitalInOut でなければなりません
pl: Kolumny muszą być typu digitalio.DigitalInOut

source: Command must be an int between 0 and 255
ja: commandは0から255の間の整数でなければなりません
pl: Komenda musi być int pomiędzy 0 a 255

source: Connection has been disconnected and can no longer be used. Create a new connection.
ja: 接続は切断済みでもう使えません。新しい接続を作成してください
pl: Połączenie zostało rozłączone i nie można go już używać. Utwórz nowe połączenie.

source: Corrupt .mpy file
ja: 破損した .mpy ファイル
pl: Uszkodzony plik .mpy

source: Could not initialize GNSS
ja: GNSSを初期化できません
pl: Nie można zainicjować GNSS

source: Could not initialize SDCard
ja: SDカードを初期化できません
pl: Nie można zainicjować SDCard

source: Could not initialize UART
ja: UARTを初期化できません
pl: Ustawienie UART nie powiodło się

source: Could not initialize channel
ja: チャネルを初期化できません
pl: Nie można zainicjować kanału

source: Could not initialize timer
ja: タイマーを初期化できません
pl: Nie można zainicjować timera

source: Could not re-init channel
ja: チャネルを再初期化できません
pl: Nie można ponownie zainicjować kanału

source: Could not re-init timer
ja: タイマーを再初期化できません
pl: Nie można ponownie zainicjować timera

source: Could not restart PWM
ja: PWMを再スタートできません
pl: Nie można ponownie uruchomić PWM

source: Could not set address
ja: アドレスをセットできません
pl: Nie można ustawić adresu

source: Could not start PWM
ja: PWMをスタートできません
pl: Nie można uruchomić PWM

source: Could not start interrupt, RX busy
ja: 割り込みをスタートできません。RXビジー
pl: Nie można rozpocząć przerwania, RX jest zajęty

source: Couldn't allocate first buffer
ja: 1つ目のバッファを確保できません
pl: Nie udała się alokacja pierwszego bufora

source: Couldn't allocate input buffer
ja: 入力バッファを確保できません
pl: Nie można przydzielić bufora wejściowego

source: Couldn't allocate second buffer
ja: 2つ目のバッファを確保できません
pl: Nie udała się alokacja drugiego bufora

source: DAC Channel Init Error
ja: DACチャネル初期化エラー
pl: Błąd inicjalizacji kanału DAC

source: DAC Device Init Error
ja: DACデバイス初期化エラー
pl: Błąd inicjowania urządzenia DAC

source: DAC already in use
ja: DACはすでに使用中
pl: DAC w użyciu

source: Data 0 pin must be byte aligned
ja: Data 0 ピンは、バイト整列されていなければなりません
pl: Nóżka data 0 musi być wyrównana do bajtu

source: Data chunk must follow fmt chunk
ja: fmtチャンクの後にdataチャンクが続かなければなりません
pl: Fragment danych musi następować po fragmencie fmt

source: Data too large for advertisement packet
ja: データが、アドバタイズメントパケットには大きすぎます
pl: Zbyt dużo danych pakietu rozgłoszeniowego

source: Destination capacity is smaller than destination_length.
ja: 宛先バッファがdestination_lengthより小さい
pl: Pojemność celu mniejsza od destination_length.

source: Device in use
ja: デバイス使用中
pl: Urządzenie w użyciu

source: DigitalInOut not supported on given pin
ja: 指定されたピンはDigitalInOutに対応していません
pl: DigitalInOut nie jest obsługiwany na podanym pinie

source: Display must have a 16 bit colorspace.
ja: ディスプレイは16ビット色空間を持たなければなりません
pl: Wyświetlacz musi mieć 16-bitową przestrzeń kolorów.

source: Display rotation must be in 90 degree increments
ja: ディスプレイの回転は90度の倍数でなければなりません
pl: Wyświetlacz można obracać co 90 stopni

source: Drive mode not used when direction is input.
ja: 方向がinputのときドライブモードは使われません
pl: Tryb sterowania nieużywany w trybie wejścia.

source: ECB only operates on 16 bytes at a time
ja: ECBは一度に16バイトの演算のみを行います
pl: ECB działa tylko na 16 bajtach naraz

source: EXTINT channel already in use
ja: EXTINTチャネルはすでに使用されています
pl: Kanał EXTINT w użyciu

source: Error in regex
ja: 正規表現にエラーがあります
pl: Błąd w regex

source: Expected a %q
ja: %qが必要
pl: Oczekiwano %q

source: Expected a Characteristic
ja: Characteristicが必要
pl: Oczekiwano charakterystyki

source: Expected a DigitalInOut
ja: DigitalInOutが必要
pl: Oczekiwano DigitalInOut

source: Expected a UUID
ja: UUIDが必要
pl: Oczekiwano UUID

source: Expected an Address
ja: Addressが必要
pl: Oczekiwano adresu

source: Expected tuple of length %d, got %d
pl: Oczekiwano krotkę długości %d, otrzymano %d

source: Failed sending command.
ja: コマンド送信に失敗
pl: Nie udało się wysłać polecenia.

source: Failed to acquire mutex, err 0x%04x
ja: ミューテックスの取得に失敗。エラー 0x%04x
pl: Nie udało się uzyskać blokady, błąd 0x%04x

source: Failed to allocate RX buffer
ja: RXバッファの確保に失敗
pl: Nie udała się alokacja bufora RX

source: Failed to allocate RX buffer of %d bytes
ja: %dバイトのRXバッファの確保に失敗
pl: Nie udała się alokacja %d bajtów na bufor RX

source: Failed to connect: internal error
ja: 接続失敗: 内部エラー
pl: Nie udało się połączyć: błąd wewnętrzny

source: Failed to connect: timeout
ja: 接続失敗: タイムアウト
pl: Nie udało się połączyć: upłynął limit czasu

source: Failed to parse MP3 file
ja: MP3ファイルのパーズに失敗
pl: Nie można przeanalizować pliku MP3

source: Failed to release mutex, err 0x%04x
ja: ミューテックスの開放に失敗。エラー 0x%04x
pl: Nie udało się zwolnić blokady, błąd 0x%04x

source: Failed to write internal flash.
ja: 内部フラッシュ書き込みに失敗
pl: Nie udało się zapisać wewnętrznej pamięci flash.

source: File exists
ja: ファイルが存在します
pl: Plik istnieje

source: Format not supported
ja: 非対応の形式
pl: Nie wspierany format

source: Framebuffer requires %d bytes
pl: Bufor ramki wymaga %d bajtów

source: Frequency captured is above capability. Capture Paused.
ja: キャプチャした周波数は能力を超えています。キャプチャ停止
pl: Uzyskana częstotliwość jest niemożliwa. Spauzowano.

source: Function requires lock
pl: Funkcja wymaga blokady

source: Group already used
ja: グループはすでに使われています
pl: Grupa już używana

source: Group full
ja: グループが一杯
pl: Grupa pełna

source: Hardware busy, try alternative pins
ja: ハードウェアビジー。代替のピンを試してください
pl: Sprzęt zajęty, wypróbuj alternatywne piny

source: Hardware in use, try alternative pins
ja: ハードウェア使用中。代わりのピンを試してください
pl: Sprzęt w użyciu, wypróbuj alternatywne piny

source: I/O operation on closed file
ja: 閉じられたファイルへのI/O操作
pl: Operacja I/O na zamkniętym pliku

source: I2C Init Error
ja: I2C初期化エラー
pl: Błąd inicjalizacji I2C

source: I2SOut not available
ja: I2SOutが利用できません
pl: I2SOut niedostępne

source: IV must be %d bytes long
ja: IVは%dバイト長でなければなりません
pl: IV musi mieć długość %d bajtów

source: Incompatible .mpy file. Please update all .mpy files. See http://adafru.it/mpy-update for more info.
ja: 非互換の.mpyファイル。全.mpyファイルを更新してください。詳細は http://adafru.it/mpy-update を参照
pl: Niekompatybilny plik .mpy. Proszę odświeżyć wszystkie pliki .mpy. Więcej informacji na http://adafrui.it/mpy-update.

source: Incorrect buffer size
ja: バッファサイズが正しくありません
pl: Niewłaściwa wielkość bufora

source: Input/output error
ja: 入力/出力エラー
pl: Błąd I/O

source: Insufficient authentication
ja: 認証が不十分
pl: Niewystarczające uwierzytelnienie

source: Insufficient encryption
ja: 暗号化が不十分
pl: Niewystarczające szyfrowanie

source: Internal error #%d
ja: 内部エラー #%d
pl: Błąd wewnętrzny #%d

source: Invalid %q
ja: 不正な %q
pl: Nieprawidłowe %q

source: Invalid %q pin
ja: 不正な%qピン
pl: Zła nóżka %q

source: Invalid BMP file
ja: 不正なBMPファイル
pl: Zły BMP

source: Invalid PWM frequency
ja: 無効なPWM周波数
pl: Zła częstotliwość PWM

source: Invalid argument
ja: 不正な引数
pl: Zły argument

source: Invalid bits per value
ja: 不正なbits per value
pl: Zła liczba bitów wartości

source: Invalid buffer size
ja: 不正なバッファサイズ
pl: Zła wielkość bufora

source: Invalid capture period. Valid range: 1 - 500
ja: 不正なキャプチャ周期。有効な周期は1-500
pl: Zły okres. Poprawny zakres to: 1 - 500

source: Invalid channel count
ja: 不正なチャンネル数
pl: Zła liczba kanałów

source: Invalid direction.
ja: 不正な方向
pl: Nieprawidłowy kierunek.

source: Invalid file
ja: 不正なファイル
pl: Zły plik

source: Invalid format chunk size
ja: フォーマットチャンクのサイズが不正
pl: Zła wielkość fragmentu formatu

source: Invalid frequency
ja: 不正な周波数
pl: Nieprawidłowa częstotliwość

source: Invalid frequency supplied
ja: 不正な周波数が与えられました
pl: Podano nieprawidłową częstotliwość

source: Invalid memory access.
ja: 不正なメモリアクセス
pl: Nieprawidłowy dostęp do pamięci.

source: Invalid number of bits
ja: 不正なビット数
pl: Zła liczba bitów

source: Invalid phase
ja: 不正なphase
pl: Zła faza

source: Invalid pin
ja: 不正なピン
pl: Zła nóżka

source: Invalid pin for left channel
ja: 左チャネルのピンが不正
pl: Zła nóżka dla lewego kanału

source: Invalid pin for right channel
ja: 右チャネルのピンが不正
pl: Zła nóżka dla prawego kanału

source: Invalid pins
ja: ピンが不正
pl: Złe nóżki

source: Invalid pins for PWMOut
ja: PWMOutのピンが不正
pl: Nieprawidłowe piny dla PWMOut

source: Invalid polarity
ja: 不正な極性
pl: Zła polaryzacja

source: Invalid properties
ja: 不正なプロパティ
pl: Nieprawidłowe właściwości

source: Invalid run mode.
ja: 不正なrun mode
pl: Zły tryb uruchomienia.

source: Invalid security_mode
ja: 不正なsecurity_mode
pl: Nieprawidłowy security_mode

source: Invalid voice count
ja: 不正なボイス数
pl: Zła liczba głosów

source: Invalid wave file
ja: 不正なwaveファイル
pl: Zły plik wave

source: Invalid word/bit length
ja: 不正なワード/ビット長
pl: Niepoprawna długość słowa/bitu

source: Key must be 16, 24, or 32 bytes long
ja: Keyの長さは、16, 24, 32バイトのいずれかでなければなりません
pl: Klucz musi mieć długość 16, 24 lub 32 bajtów

source: LHS of keyword arg must be an id
ja: キーワード引数の左辺には識別子が必要
pl: Lewa strona argumentu nazwanego musi być nazwą

source: Layer must be a Group or TileGrid subclass.
ja: レイヤはGroupかTileGridのサブクラスでなければなりません
pl: Layer musi dziedziczyć z Group albo TileGrid.

source: Length must be an int
ja: 長さには整数が必要
pl: Długość musi być całkowita

source: Length must be non-negative
ja: Lengthは非負数でなければなりません
pl: Długość musi być nieujemna

source: MISO pin init failed.
ja: MISOピン初期化に失敗
pl: Nie powiodło się ustawienie pinu MISO.

source: MOSI pin init failed.
ja: MOSIピン初期化に失敗
pl: Nie powiodło się ustawienie pinu MOSI.

source: Maximum x value when mirrored is %d
pl: Największa wartość x przy odwróceniu to %d

source: Messages limited to 8 bytes
pl: Wiadomości ograniczone do 8 bajtów

source: MicroPython NLR jump failed. Likely memory corruption.
ja: MicroPython NLRジャンプ失敗。メモリ破壊の可能性あり
pl: Skok MicroRython NLR nie powiódł się. Prawdopodobne uszkodzenie pamięci.

source: MicroPython fatal error.
ja: MicroPython致命的エラー
pl: Błąd krytyczny MicroPython.

source: Microphone startup delay must be in range 0.0 to 1.0
ja: マイクのスタートアップディレイは 0.0 から 1.0 の間でなければなりません
pl: Opóźnienie włączenia mikrofonu musi być w zakresie od 0.0 do 1.0

source: Missing MISO or MOSI Pin
ja: MISOまたはMOSIピンがありません
pl: Brak pinu MISO lub MOSI

source: Must provide MISO or MOSI pin
ja: MISOピンまたはMOSIピンが必要
pl: Należy podać pin MISO lub MOSI

source: Name too long
ja: 名前が長すぎます
pl: Za długa nazwa

source: No DAC on chip
ja: チップにDACがありません
pl: Brak DAC

source: No DMA channel found
ja: DMAチャネルが見つかりません
pl: Nie znaleziono kanału DMA

source: No MISO Pin
ja: MISOピンなし
pl: Brak pinu MISO

source: No MOSI Pin
ja: MOSIピンがありません
pl: Brak pinu MOSI

source: No RX pin
ja: RXピンがありません
pl: Brak nóżki RX

source: No TX pin
ja: TXピンがありません
pl: Brak nóżki TX

source: No available clocks
ja: 利用できるクロックがありません
pl: Brak wolnych zegarów

source: No connection: length cannot be determined
ja: 接続なし: 長さが決定できません
pl: Brak połączenia: nie można ustalić długości

source: No default %q bus
ja: デフォルトの %q バスがありません
pl: Nie ma domyślnej magistrali %q

source: No free GCLKs
ja: 使われていないGCLKがありません
pl: Brak wolnych GLCK

source: No hardware random available
ja: 利用可能なハードウェア乱数なし
pl: Brak generatora liczb losowych

source: No hardware support on pin
ja: ピンにハードウェア対応がありません
pl: Brak sprzętowej obsługi na nóżce

source: No key was specified
ja: キーが指定されていません
pl: Nie określono klucza

source: No more channels available
ja: 使えるチャネルがもうありません
pl: Brak dostępnych kanałów

source: No space left on device
ja: デバイスに空き容量が残っていません
pl: Brak miejsca

source: No such file/directory
ja: 指定されたファイル/ディレクトリはありません
pl: Brak pliku/katalogu
