Repository: syntheticfuture/circuitpython
Catalog: locale/*.po
Languages: ja, pl

source: memory allocation failed, allocating %u bytes
pl: alokacja pamięci nie powiodła się, alokowano %u bajtów

source: memory allocation failed, heap is locked
ja: メモリ確保に失敗。ヒープがロックされています
pl: alokacja pamięci nie powiodła się, sterta zablokowana

source: module not found
ja: モジュールが見つかりません
pl: brak modułu

source: multiple *x in assignment
pl: wiele *x w przypisaniu

source: multiple bases have instance lay-out conflict
pl: konflikt w planie instancji z powodu wielu baz

source: multiple inheritance not supported
ja: 複数継承には対応していません
pl: wielokrotne dziedzicznie niewspierane

source: must raise an object
pl: wyjątek musi być obiektem

source: must use keyword argument for key function
pl: funkcja key musi być podana jako argument nazwany

source: name '%q' is not defined
ja: 名前 '%q' は定義されていません
pl: nazwa '%q' niezdefiniowana

source: name not defined
ja: 名前が定義されていません
pl: nazwa niezdefiniowana

source: name reused for argument
ja: 引数で名前が再利用されています
pl: nazwa użyta ponownie jako argument

source: native yield
pl: natywny yield

source: need more than %d values to unpack
ja: アンパックする値は%d個では足りません
pl: potrzeba więcej niż %d do rozpakowania

source: negative power with no float support
pl: ujemna potęga, ale brak obsługi liczb zmiennoprzecinkowych

source: negative shift count
ja: シフトカウントが負数
pl: ujemne przesunięcie

source: no active exception to reraise
pl: brak wyjątku do ponownego rzucenia

source: no available NIC
ja: 利用可能なNICがありません
pl: brak wolnego NIC

source: no binding for nonlocal found
ja: nonlocalの対象が見つかりません
pl: brak wiązania dla zmiennej nielokalnej

source: no module named '%q'
ja: '%q' という名前のモジュールはありません
pl: brak modułu o nazwie '%q'

source: no such attribute
ja: 指定の属性はありません
pl: nie ma takiego atrybutu

source: non-default argument follows default argument
ja: デフォルト引数の後に通常の引数は置けません
pl: argument z wartością domyślną przed argumentem bez

source: non-hex digit found
ja: 16進数以外の桁があります
pl: cyfra nieszesnastkowa

source: non-keyword arg after */**
ja: */** の後に非キーワード引数は置けません
pl: argument nienazwany po */**

source: non-keyword arg after keyword arg
ja: キーワード引数の後に非キーワード引数は置けません
pl: argument nienazwany po nazwanym

source: not a 128-bit UUID
ja: 128ビットのUUIDではありません
pl: to nie jest 128-bitowy UUID

source: not all arguments converted during string formatting
ja: 文字列書式化で全ての引数が使われていません
pl: nie wszystkie argumenty wykorzystane w formatowaniu

source: not enough arguments for format string
ja: 書式化文字列への引数が足りません
pl: nie dość argumentów przy formatowaniu

source: number of points must be at least 2
pl: liczba punktów musi wynosić co najmniej 2

source: object does not support item assignment
ja: オブジェクトは要素の代入に対応していません
pl: obiekt nie obsługuje przypisania do elementów

source: object does not support item deletion
ja: オブジェクトは要素の削除に対応していません
pl: obiekt nie obsługuje usuwania elementów

source: object has no len
ja: オブジェクトがlenを持っていません
pl: obiekt nie ma len

source: object is not subscriptable
ja: オブジェクトは要素の取得に対応していません
pl: obiekt nie ma elementów

source: object not an iterator
ja: オブジェクトがイテレータではありません
pl: obiekt nie jest iteratorem

source: object not callable
ja: オブジェクトは呼び出し可能でありません
pl: obiekt nie jest wywoływalny

source: object not in sequence
pl: obiektu nie ma sekwencji

source: object not iterable
ja: オブジェクトはイテレートできません
pl: obiekt nie jest iterowalny

source: object with buffer protocol required
pl: wymagany obiekt z protokołem buforu

source: odd-length string
ja: 奇数長の文字列
pl: łańcuch o nieparzystej długości

source: offset out of bounds
pl: offset poza zakresem

source: only slices with step=1 (aka None) are supported
pl: tylko fragmenty ze step=1 (lub None) są wspierane

source: operands could not be broadcast together
pl: operandy nie mogły być rozgłaszane razem

source: operation is not supported for given type
ja: 演算は与えられた型に対応していません
pl: operacja nie jest obsługiwana dla danego typu

source: ord expects a character
ja: ord()は1文字を受け取ります
pl: ord oczekuje znaku

source: ord() expected a character, but string of length %d found
ja: ord()は1文字を要求しますが、長さ %d の文字列が与えられました
pl: ord() oczekuje znaku, a jest łańcuch od długości %d

source: overflow converting long int to machine word
ja: long intをマシンのwordに変換する際にオーバーフローしました
pl: przepełnienie przy konwersji long in to słowa maszynowego

source: palette must be 32 bytes long
ja: パレットの長さは32バイトでなければなりません
pl: paleta musi mieć 32 bajty długości

source: palette_index should be an int
ja: palette_indexには整数が必要
pl: palette_index powinien być całkowity

source: parameter annotation must be an identifier
ja: 引数アノテーションは識別子でなければなりません
pl: anotacja parametru musi być identyfikatorem

source: parameters must be registers in sequence a2 to a5
pl: parametry muszą być rejestrami w kolejności a2 do a5

source: parameters must be registers in sequence r0 to r3
pl: parametry muszą być rejestrami w kolejności r0 do r3

source: pixel coordinates out of bounds
pl: współrzędne piksela poza zakresem

source: pixel value requires too many bits
pl: wartość piksela wymaga zbyt wielu bitów

source: pixel_shader must be displayio.Palette or displayio.ColorConverter
ja: pixel_shaderはdisplayio.Paletteかdisplayio.ColorConverterのどちらかでなければなりません
pl: pixel_shader musi być typu displayio.Palette lub dispalyio.ColorConverter

source: pop from an empty PulseIn
pl: pop z pustego PulseIn

source: pow() 3rd argument cannot be 0
ja: pow()の3つ目の引数は0にできません
pl: trzeci argument pow() nie może być 0

source: pow() with 3 arguments requires integers
ja: pow()の第3引数には整数が必要
pl: trzyargumentowe pow() wymaga liczb całkowitych

source: queue overflow
ja: キューがオーバーフローしました
pl: przepełnienie kolejki

source: real and imaginary parts must be of equal length
ja: 実数部と虚数部は同じ長さでなければなりません
pl: rzeczywiste i urojone części muszą mieć jednakową długość

source: relative import
ja: 相対インポート
pl: relatywny import

source: requested length %d but object has length %d
ja: 必要な長さは%dですがオブジェクトの長さは%d
pl: zażądano długości %d ale obiekt ma długość %d

source: return annotation must be an identifier
ja: 戻り値のアノテーションは識別子でなければなりません
pl: anotacja wartości musi być identyfikatorem

source: return expected '%q' but got '%q'
pl: return oczekiwał '%q', a jest '%q'

source: sample_source buffer must be a bytearray or array of type 'h', 'H', 'b' or 'B'
ja: sample_source バッファには bytearray または 'h','H','b','B'型のarrayが必要
pl: bufor sample_source musi być bytearray lub tablicą typu 'h', 'H', 'b' lub 'B'

source: sampling rate out of range
ja: サンプリングレートが範囲外
pl: częstotliwość próbkowania poza zakresem

source: schedule stack full
ja: スケジュールスタックが一杯
pl: stos planu pełen

source: script compilation not supported
ja: スクリプトのコンパイルは非対応
pl: kompilowanie skryptów nieobsługiwane

source: sign not allowed in string format specifier
ja: 文字列フォーマット指定子で符号は使えません
pl: znak jest niedopuszczalny w specyfikacji formatu łańcucha

source: sign not allowed with integer format specifier 'c'
ja: 整数フォーマット指定子'c'で符号は使えません
pl: znak jest niedopuszczalny w specyfikacji 'c'

source: single '}' encountered in format string
ja: 文字列フォーマット中に孤立した '}' があります
pl: pojedynczy '}' w specyfikacji formatu

source: sleep length must be non-negative
ja: sleepの長さは非負数でなければなりません
pl: okres snu musi być nieujemny

source: slice step cannot be zero
pl: zerowy krok

source: small int overflow
ja: small int オーバーフロー
pl: przepełnienie small int

source: soft reboot
ja: ソフトリブート
pl: programowy reset

source: sort argument must be an ndarray
pl: argument sort musi być ndarray

source: source palette too large
pl: źródłowa paleta jest zbyt duża

source: start/end indices
pl: początkowe/końcowe indeksy

source: start_x should be an int
pl: start_x powinien być całkowity

source: step must be non-zero
ja: stepは非ゼロ値でなければなりません
pl: step nie może być zerowe

source: stop must be 1 or 2
ja: stopは1または2のいずれか
pl: stop musi być 1 lub 2

source: stop not reachable from start
pl: stop nie jest osiągalne ze start

source: stream operation not supported
ja: ストリーム操作は非対応
pl: operacja na strumieniu nieobsługiwana

source: string not supported; use bytes or bytearray
ja: 文字列ではなくbytesまたはbytesarrayが必要
pl: łańcuchy nieobsługiwane; użyj bytes lub bytearray

source: struct: cannot index
pl: struct: nie można indeksować

source: struct: no fields
pl: struct: brak pól

source: substring not found
ja: 部分文字列が見つかりません
pl: brak pod-łańcucha

source: super() can't find self
ja: super()がselfを見つけられません
pl: super() nie może znaleźć self

source: syntax error in JSON
ja: JSONに構文エラーがあります
pl: błąd składni w JSON

source: syntax error in uctypes descriptor
ja: uctypedディスクリプタの構文エラー
pl: błąd składni w deskryptorze uctypes

source: threshold must be in the range 0-65536
ja: threshouldは0から65536まで
pl: threshold musi być w zakresie 0-65536

source: time.struct_time() takes a 9-sequence
ja: time.struct_time()は9要素のシーケンスを受け取ります
pl: time.struct_time() wymaga 9-elementowej sekwencji

source: timeout must be >= 0.0
ja: timeoutは0.0以上でなければなりません
pl: timeout musi być >= 0.0

source: timestamp out of range for platform time_t
ja: timestampがプラットフォームのtime_tの範囲外
pl: timestamp poza zakresem dla time_t na tej platformie

source: too many arguments provided with the given format
ja: 指定された書式に対して引数が多すぎます
pl: zbyt wiele argumentów podanych dla tego formatu

source: too many indices
ja: インデクスが多すぎます
pl: zbyt wiele indeksów

source: too many values to unpack (expected %d)
ja: アンパックする値が多すぎます (%d個を期待)
pl: zbyt wiele wartości do rozpakowania (oczekiwano %d)

source: tuple index out of range
pl: indeks krotki poza zakresem

source: tuple/list has wrong length
ja: タプル/リストの長さが正しくありません
pl: krotka/lista ma złą długość

source: tx and rx cannot both be None
ja: txとrxを両方ともNoneにできません
pl: tx i rx nie mogą być oba None

source: type '%q' is not an acceptable base type
ja: 型'%q'はベース型として使えません
pl: typ '%q' nie może być bazowy

source: type is not an acceptable base type
ja: この型はベース型にできません
pl: typ nie może być bazowy

source: type object '%q' has no attribute '%q'
pl: typ '%q' nie ma atrybutu '%q'

source: type takes 1 or 3 arguments
ja: typeは1つか3つの引数をとります
pl: type wymaga 1 lub 3 argumentów

source: ulonglong too large
pl: ulonglong zbyt wielkie

source: unary op %q not implemented
ja: 単項演算子 %q は未実装
pl: operator unarny %q niezaimplementowany

source: unexpected indent
pl: złe wcięcie

source: unexpected keyword argument
pl: zły argument nazwany

source: unexpected keyword argument '%q'
ja: キーワード引数'%q'は使えません
pl: zły argument nazwany '%q'

source: unicode name escapes
pl: nazwy unicode

source: unindent does not match any outer indentation level
ja: インデントの解除が、外側のどのインデントにも一致していません
pl: wcięcie nie pasuje do żadnego wcześniejszego wcięcia

source: unknown conversion specifier %c
pl: zła specyfikacja konwersji %c

source: unknown type
ja: 不明な型
pl: zły typ

source: unknown type '%q'
ja: 不明な型 '%q'
pl: zły typ '%q'

source: unmatched '{' in format
ja: 書式中にマッチしない '{' があります
pl: niepasujące '{' for formacie

source: unreadable attribute
ja: 読み込み不可能な属性
pl: nieczytelny atrybut

source: unsupported %q type
ja: 非対応の型 %q
pl: zły typ %q

source: unsupported Thumb instruction '%s' with %d arguments
pl: zła instrukcja Thumb '%s' z %d argumentami

source: unsupported Xtensa instruction '%s' with %d arguments
pl: zła instrukcja Xtensa '%s' z %d argumentami

source: unsupported format character '%c' (0x%x) at index %d
pl: zły znak formatowania '%c' (0x%x) na pozycji %d

source: unsupported type for operator
ja: 演算子が対応していない型
pl: zły typ dla operatora

source: value must fit in %d byte(s)
ja: 値は%dバイトに収まらなければなりません
pl: wartość musi mieścić się w %d bajtach

source: value_count must be > 0
ja: value_countは0より大きくなければなりません
pl: value_count musi być > 0

source: vectors must have same lengths
pl: wektory muszą mieć identyczną długość

source: wrong number of arguments
pl: zła liczba argumentów

source: wrong number of values to unpack
ja: アンパックする値の個数が不正です
pl: zła liczba wartości do rozpakowania

source: wrong operand type
pl: zły typ operandu

source: x value out of bounds
ja: xが範囲外
pl: x poza zakresem

source: y should be an int
ja: yは整数でなければなりません
pl: y powinno być całkowite

source: y value out of bounds
ja: yが範囲外
pl: y poza zakresem

source: zero step
ja: ステップが0
pl: zerowy krok

source: %q list must be a list
ja: %q リストはリストでなければなりません

source: '%q' object cannot assign attribute '%q'
ja: オブジェクト'%q'に属性'%q'を割り当てられません

source: 'coroutine' object is not an iterator
ja: 'coroutine' オブジェクトはイテレータではありません

source: All CAN peripherals are in use
ja: 全てのCAN周辺機器が使用中

source: All RX FIFOs in use
ja: 全てのRX FIFOが使用中

source: Already advertising.
ja: すでにアドバータイズ中

source: Already running
ja: すでに実行中

source: At most %d %q may be specified (not %d)
ja: 最大で %d個の %q が指定できます（%d個でなく）

source: Below minimum frame rate
ja: 最低のフレームレート未満

source: Buffer is not a bytearray.
ja: バッファがbytearrayではありません

source: Call super().__init__() before accessing native object.
ja: ネイティブオブジェクトにアクセスする前にsuper().__init__()を呼び出してください

source: Can't set CCCD on local Characteristic
ja: ローカルのCharacteristicにはCCCDを設定できません

source: Cannot create a new Adapter; use _bleio.adapter;
ja: Adapterは作成できません。_bleio.adapterを使用してください。

source: CircuitPython core code crashed hard. Whoops!
ja: CircuitPythonのコアコードが激しくクラッシュしました。おっと！

source: Corrupt raw code
ja: 破損したraw code

source: Could not initialize Camera
ja: カメラを初期化できません

source: Couldn't allocate decoder
ja: デコーダを確保できません

source: Crash into the HardFault_Handler.
ja: クラッシュしてHardFault_Handlerに入りました

source: Expected a Service
ja: Serviceが必要

source: Expected a UART
ja: UARTが必要

source: FFT is defined for ndarrays only
ja: FFTはndarrayでのみ使えます

source: Failed to allocate Wifi memory
ja: Wi-Fiのメモリの確保に失敗

source: Frequency must match existing PWMOut using this timer
ja: このタイマーを使う既存のPWMOutと周波数を一致させる必要があります

source: Internal define error
ja: 内部定義エラー

source: Invalid %q pin selection
ja: 不正な%qピン選択

source: Invalid ADC Unit value
ja: 不正なADCユニット値

source: Invalid BSSID
ja: 不正なBSSID

source: Invalid DAC pin supplied
ja: 不正なDACピンが与えられました

source: Invalid byteorder string
ja: 不正なバイトオーダー文字列

source: Invalid voice
ja: 不正なボイス

source: Layer already in a group.
ja: レイヤはすでにグループに含まれています

source: Must be a %q subclass.
ja: %q のサブクラスでなければなりません

source: Must use a multiple of 6 rgb pins, not %d
ja: %d個でなく6の倍数個のrgbピンを使ってください

source: No hardware support on clk pin
ja: clkピンにハードウェア対応がありません

source: No long integer support
ja: long integerに対応していません

source: No more timers available
ja: 使えるタイマーがもうありません

source: No more timers available on this pin.
ja: このピンには使えるタイマーがもうありません

source: No pulldown on pin; 1Mohm recommended
ja: ピンにプルダウンがありません。1Mオーム推奨

source: Not a valid IP string
ja: 不正なIP文字列です

source: Not running saved code.
ja: 保存されたコードは実行していません。

source: Pin is input only
ja: ピンは入力専用

source: Pin number already reserved by EXTI
ja: ピン番号はすでにEXTIによって予約されています

source: Prefix buffer must be on the heap
ja: Prefixバッファはヒープ上になければなりません

source: RNG DeInit Error
ja: RNG解体エラー

source: RNG Init Error
ja: 乱数生成器の初期化エラー

source: RTS/CTS/RS485 Not yet supported on this device
ja: RTS/CTS/RS485はこのデバイスでは未対応

source: Running in safe mode!
ja: セーフモードで実行中！

source: SD card CSD format not supported
ja: SDカードのCSDフォーマットは非対応

source: SDIO Init Error %d
ja: SDIO初期化エラー %d

source: Size not supported
ja: サイズは対応していません

source: System entry must be gnss.SatelliteSystem
ja: system引数はgnss.SatelliteSystemでなければなりません

source: Temperature read timed out
ja: 温度読み取りがタイムアウトしました

source: The CircuitPython heap was corrupted because the stack was too small. Please increase the stack size if you know how, or if not:
ja: スタックが小さすぎたためCircuitPythonのヒープが壊れました。 スタックサイズを上げるか、その方法が分からなければ:

source: The `microcontroller` module was used to boot into safe mode. Press reset to exit safe mode.
ja: `microcontroller` モジュールが使われてセーフモードで起動しました。セーフモードを抜けるにはリセットを押します。

source: The microcontroller's power dipped. Make sure your power supply provides enough power for the whole circuit and press reset (after ejecting CIRCUITPY).
ja: マイコンの電力が降下しました。使っている電源が十分な電力を回路に供給することを確認し (CIRCUITPYを取り出してから) リセットを押してください。

source: Tile index out of bounds
ja: タイルのインデクスが範囲外

source: Tile value out of bounds
ja: タイル値が範囲外

source: Timeout is too long: Maximum timeout length is %d seconds
ja: タイムアウトが長すぎです。最大のタイムアウト長は%d秒

source: UART De-init error
ja: UART解放エラー

source: UART Init Error
ja: UARTの初期化エラー

source: UART Re-init error
ja: UARTの再初期化エラー

source: UUID integer value must be 0-0xffff
ja: UUIDの整数値は0から0xffffの間でなければなりません

source: Unable to find I2C Display at %x
ja: I2Cディスプレイを %x に見つけられません

source: Unknown gatt error: 0x%04x
ja: 不明なGATTエラー: 0x%04x

source: Unknown reason.
ja: 理由不明

source: Unknown security error: 0x%04x
ja: 不明なセキュリティエラー: 0x%04x

source: Unknown soft device error: %04x
ja: 不明なソフトデバイスエラー: %04x

source: Voltage read timed out
ja: 電圧読み取りがタイムアウト

source: WatchDogTimer is not currently running
ja: WatchDogTimerは現在動作していません

source: WatchDogTimer.mode cannot be changed once set to WatchDogMode.RESET
ja: WatchDogTimer.modeはいったんWatchDogMode.RESETに設定すると変更不可

source: WiFi password must be between 8 and 63 characters
ja: WiFiパスワードは8〜63文字でなければなりません

source: argsort argument must be an ndarray
ja: argsortの引数はndarrayでなければなりません

source: argument must be ndarray
ja: 引数はndarrayでなければなりません

source: arguments must be ndarrays
ja: 引数はndarrayでなければなりません

source: byteorder is not a string
ja: byteorderが文字列ではありません

source: can't convert to %q
ja: %q に変換できません

source: color buffer must be a buffer, tuple, list, or int
ja: カラーバッファはbuffer, tuple, list, int のいずれかです

source: convolve arguments must be linear arrays
ja: convolve引数には1次元arrayが必要

source: convolve arguments must be ndarrays
ja: convolve引数はndarrayでなければなりません

source: could not invert Vandermonde matrix
ja: ヴァンデルモンド行列の逆行列を求められません

source: data must be iterable
ja: dataはイテレート可能でなければなりません

source: data must be of equal length
ja: dataは同じ長さでなければなりません

source: diff argument must be an ndarray
ja: 引数はndarrayでなければなりません

source: f-string expression part cannot include a '#'
ja: f-文字列の表現部は '#' を持てません

source: f-string expression part cannot include a backslash
ja: f-文字列の表現部はバックスラッシュを持てません

source: f-string: empty expression not allowed
ja: f-文字列: 空の表現は許されません

source: f-string: expecting '}'
ja: f-string: '}'が必要

source: f-string: single '}' is not allowed
ja: f-string: 1つだけの'}'は許されません

source: first argument must be a callable
ja: 1つ目の引数は呼び出し可能でなければなりません

source: first argument must be an ndarray
ja: 1つ目の引数はndarrayでなければなりません

source: flip argument must be an ndarray
ja: flipの引数はndarrayでなければなりません

source: indices must be integers, slices, or Boolean lists
ja: インデクスは、整数、スライス、boolのリストのいずれかでなければなりません

source: input matrix is asymmetric
ja: 入力行列が非対称

source: input matrix is singular
ja: 入力が非正則行列

source: input must be tuple, list, range, or ndarray
ja: 入力はtuple, list, range, ndarrayでなければなりません

source: invalid hostname
ja: 不正なホスト名

source: iterables are not of the same length
ja: iterableが同じ長さではありません

source: iterations did not converge
ja: 収束しません

source: level must be between 0 and 1
ja: levelは0から1の間でなければなりません

source: malformed f-string
ja: 不正な形式のf-string

source: matrix dimensions do not match
ja: 行列の次元が一致しません

source: matrix is not positive definite
ja: 正定値行列ではありません

source: no SD card
ja: SDカードがありません

source: no reset pin available
ja: 利用可能なリセットピンがありません

source: no response from SD card
ja: SDカードからの応答がありません

source: object '%q' is not a tuple or list
ja: オブジェクト'%q'がタプルやリストでありません

source: object of type '%q' has no len()
ja: オブジェクト（型 '%q'）はlen()を持ちません

source: only bit_depth=16 is supported
ja: bit_depth=16のみ対応しています

source: operation is not implemented on ndarrays
ja: この演算はndarray上で実装されていません

source: out of range of source
ja: ソースが範囲外

source: raw f-strings are not implemented
ja: raw f-文字列は実装されていません

source: rgb_pins[%d] is not on the same port as clock
ja: rgb_pins[%d]はクロックと同じポートではありません

source: slice step can't be zero
ja: スライスのステップは0にできません

source: string indices must be integers, not %q
ja: 文字列のインデクスは整数でなければなりません (%qでなく)

source: timeout duration exceeded the maximum supported value
ja: タイムアウト長は対応する最大値を超えています

source: timeout must be 0.0-100.0 seconds
ja: timeoutは0.0〜100.0秒でなければなりません

source: timeout waiting for v1 card
ja: v1カードの待機がタイムアウト

source: timeout waiting for v2 card
ja: v2カードの待機がタイムアウトしました

source: trapz is defined for 1D arrays of equal length
ja: trapzは同じ長さの1次元arrayに対して定義されています

source: unknown format code '%c' for object of type '%q'
ja: 型'%q'のオブジェクトに対する不明な書式コード'%c'

source: unsupported type for %q: '%q'
ja: %q が対応していない型: '%q'

source: unsupported types for %q: '%q', '%q'
ja: %q が対応していない型: '%q', '%q'

source: watchdog timeout must be greater than 0
ja: watchdogのtimeoutは0以上でなければなりません

source: window must be <= interval
ja: windowはinterval以下でなければなりません

source: zi must be an ndarray
ja: ziはndarrayでなければなりません

source: zi must be of float type
ja: ziはfloat値でなければなりません
